In [2]:
import pandas as pd

In [3]:
l1= [1,2,3,4]

In [4]:
l2=pd.DataFrame(l1)
print(l2)

   0
0  1
1  2
2  3
3  4

In [5]:
l2

   0
0  1
1  2
2  3
3  4

In [6]:
l3= [[1,2,3],[3,4,5],[5,6,7],["a","b","c"]]

In [7]:
l4= pd.DataFrame(l3)
l4

   0  1  2
0  1  2  3
1  3  4  5
2  5  6  7
3  a  b  c

In [8]:
dict_1= {'ID':[1,2,3,4,5],'name':["A","B","c","d","E"]}

In [9]:
pd.DataFrame(dict_1)

   ID name
0   1    A
1   2    B
2   3    c
3   4    d
4   5    E

In [10]:
dict_2= [{"A":1,"B":2,"E":15},{"A":3,"B":4,"C":5},{"D":10},{"E":11}]

In [11]:
pd.DataFrame(dict_2)

     A    B     E    C     D
0  1.0  2.0  15.0  NaN   NaN
1  3.0  4.0   NaN  5.0   NaN
2  NaN  NaN   NaN  NaN  10.0
3  NaN  NaN  11.0  NaN   NaN

In [14]:
df1= {'ID':pd.Series([1,2,3]),'Name':["a","b","c" ],'E_id':pd.Series([12,33,44])}

In [15]:
pd.DataFrame(df1)

   ID Name  E_id
0   1    a    12
1   2    b    33
2   3    c    44

In [17]:
import pandas as pd

In [19]:
df1= ([1,2,3],[2,3,4],[4,5,6])

In [20]:
pd.DataFrame(df1)

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [23]:
df2= {'id':[1,2,3], 'e_name':["A","B","C"],'cust_det':["amol","amit","akash"]}

In [24]:
pd.DataFrame(df2)

   id e_name cust_det
0   1      A     amol
1   2      B     amit
2   3      C    akash